Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/сфпФормаВыбораАбонента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////
/// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура сфпСформироватьДеревоАбонентов()
	ДеревоАбонентов.ПолучитьЭлементы().Очистить();
	Если СписокОбъектов.Количество() = 0 Тогда Возврат; КонецЕсли;
	КореньДерева = ДеревоАбонентов.ПолучитьЭлементы();
	Для Каждого ЭлементСписка Из СписокОбъектов Цикл
		СсылкаНаЭлемент = ЭлементСписка.Значение;
		Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Сотрудники") И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (сотрудник)'");
		ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Организации") И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (организация)'");
		ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Контрагенты") Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			Ведущий = РаботаСКонтактнымиЛицами.ПолучитьВедущегоКонтрагента(СсылкаНаЭлемент);
			Если ЗначениеЗаполнено(Ведущий) Тогда
				Если СсылкаНаЭлемент.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.КонтактноеЛицо") Тогда
					ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + " <" + Строка(Ведущий) + ">" + Нстр("ru = ' (контактное лицо ведущего контрагента)'");
				Иначе
					Если СсылкаНаЭлемент = Ведущий Тогда
						Если СсылкаНаЭлемент.ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЧастноеЛицо")
							ИЛИ СсылкаНаЭлемент.ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЧастныйПредприниматель") Тогда
							ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (контрагент, физ. лицо)'");
						Иначе
							ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (контрагент, юр. лицо)'");
						КонецЕсли;
					Иначе
						ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + " <" + Строка(Ведущий) + ">" + Нстр("ru = ' (контрагент ведущего контрагента)'");
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если СсылкаНаЭлемент.ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЧастноеЛицо")
					ИЛИ СсылкаНаЭлемент.ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЧастныйПредприниматель") Тогда
					ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (контрагент, физ. лицо)'");
				Иначе
					ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (контрагент, юр. лицо)'");
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодразделенияКомпании") И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (подразделение компании)'");;
		КонецЕсли;
	КонецЦикла;
	Если ДеревоАбонентов.ПолучитьЭлементы().Количество() = 0 Тогда
		Элементы.ФормаОткрытьОбъект.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура сфпСформироватьЗаголовокФормы(ПодборНомера)
	Если ПодборНомера Тогда
		Заголовок = Нстр(" ru = 'Выберите контакт для номера '") + НомерТелефона;
	Иначе
		Заголовок = Нстр("ru = 'Выберите связанный объект '");
	КонецЕсли;		
КонецПроцедуры	


///////////////////////////////////////////////////////////////////////////
/// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("СписокОбъектов") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СписокОбъектов = Параметры.СписокОбъектов;
	Если Параметры.Свойство("НомерТелефона") Тогда
		НомерТелефона = Параметры.НомерТелефона;
	КонецЕсли;	
	Если Параметры.Свойство("ТолькоКлиентыИКЛ") Тогда
		ТолькоКлиентыИКЛ = Параметры.ТолькоКлиентыИКЛ;
	КонецЕсли;		
	сфпСформироватьЗаголовокФормы(НЕ Параметры.Свойство("ПодборВСобытие"));
	сфпСформироватьДеревоАбонентов();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
/// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДеревоАбонентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДеревоАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;
	Закрыть(ТекДанные.Ссылка);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
/// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	ТекДанные = Элементы.ДеревоАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Предупреждение(Нстр("ru = 'Не выбран контакт!'"),);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
		ОткрытьЗначение(ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры
